In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_excel('Bike sales Data.xlsx')
df.head(5)

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike
0,12496,M,F,40000,1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No
1,24107,M,M,30000,3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No
2,14177,M,M,80000,5,Partial College,Professional,No,2,2-5 Miles,Europe,60,No
3,24381,S,M,70000,0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes
4,25597,S,M,30000,0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes

In [4]:
df.to_csv('bike.csv', index=False)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1026 entries, 0 to 1025
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                1026 non-null   int64
 1   Marital Status    1026 non-null   object
 2   Gender            1026 non-null   object
 3   Income            1026 non-null   int64
 4   Children          1026 non-null   int64
 5   Education         1026 non-null   object
 6   Occupation        1026 non-null   object
 7   Home Owner        1026 non-null   object
 8   Cars              1026 non-null   int64
 9   Commute Distance  1026 non-null   object
 10  Region            1026 non-null   object
 11  Age               1026 non-null   int64
 12  Purchased Bike    1026 non-null   object
dtypes: int64(5), object(8)
memory usage: 104.3+ KB

In [6]:
df.describe()

                 ID         Income     Children         Cars          Age
count   1026.000000    1026.000000  1026.000000  1026.000000  1026.000000
mean   19969.196881   56208.576998     1.892788     1.437622    44.138402
std     5332.672942   31293.284007     1.626670     1.125538    11.349282
min    11000.000000   10000.000000     0.000000     0.000000    25.000000
25%    15304.750000   30000.000000     0.000000     1.000000    35.000000
50%    19744.000000   60000.000000     2.000000     1.000000    43.000000
75%    24457.750000   70000.000000     3.000000     2.000000    52.000000
max    29447.000000  170000.000000     5.000000     4.000000    89.000000

In [11]:
df.drop(2)

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike
0,12496,M,F,40000,1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No
1,24107,M,M,30000,3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No
3,24381,S,M,70000,0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes
4,25597,S,M,30000,0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes
5,13507,M,F,10000,2,Partial College,Manual,Yes,0,1-2 Miles,Europe,50,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1021,16466,S,F,20000,0,Partial High School,Manual,No,2,0-1 Miles,Europe,32,Yes
1022,19273,M,F,20000,2,Partial College,Manual,Yes,0,0-1 Miles,Europe,63,No
1023,22400,M,M,10000,0,Partial College,Manual,No,1,0-1 Miles,Pacific,26,Yes
1024,20942,S,F,20000,0,High School,Manual,No,1,5-10 Miles,Europe,31,No
1025,18484,S,M,80000,2,High School,Skilled Manual,No,2,1-2 Miles,Pacific,50,Yes

In [12]:
df

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike
0,12496,M,F,40000,1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No
1,24107,M,M,30000,3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No
2,14177,M,M,80000,5,Partial College,Professional,No,2,2-5 Miles,Europe,60,No
3,24381,S,M,70000,0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes
4,25597,S,M,30000,0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1021,16466,S,F,20000,0,Partial High School,Manual,No,2,0-1 Miles,Europe,32,Yes
1022,19273,M,F,20000,2,Partial College,Manual,Yes,0,0-1 Miles,Europe,63,No
1023,22400,M,M,10000,0,Partial College,Manual,No,1,0-1 Miles,Pacific,26,Yes
1024,20942,S,F,20000,0,High School,Manual,No,1,5-10 Miles,Europe,31,No
1025,18484,S,M,80000,2,High School,Skilled Manual,No,2,1-2 Miles,Pacific,50,Yes

In [13]:
# Create sample datasets
df1 = pd.DataFrame({
    'ID': range(1, 6),
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Salary': [50000, 60000, 75000, 90000, np.nan]
})

In [14]:
df2 = pd.DataFrame({
    'ID': range(3, 8),
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales'],
    'Location': ['New York', 'San Francisco', 'Chicago', 'Boston', 'Los Angeles']
})

In [15]:
df1

   ID     Name  Age   Salary
0   1    Alice   25  50000.0
1   2      Bob   30  60000.0
2   3  Charlie   35  75000.0
3   4    David   40  90000.0
4   5      Eve   45      NaN

In [17]:
print(df1.to_string(index=False))

 ID    Name  Age  Salary
  1   Alice   25 50000.0
  2     Bob   30 60000.0
  3 Charlie   35 75000.0
  4   David   40 90000.0
  5     Eve   45     NaN

In [19]:
print(df1.shape)

(5, 4)

In [20]:
print("\nColumns:")
print(df1.columns)

Columns:
Index(['ID', 'Name', 'Age', 'Salary'], dtype='object')

In [23]:
print(df1['Age'].value_counts())

Age
25    1
30    1
35    1
40    1
45    1
Name: count, dtype: int64

In [25]:
df1.isnull().sum()

ID        0
Name      0
Age       0
Salary    1
dtype: int64

In [27]:
df1['Salary'].isnull()

0    False
1    False
2    False
3    False
4     True
Name: Salary, dtype: bool

In [28]:
print("\nFilling NA values:")
print(df1.fillna({'Salary': df1['Salary'].mean()}))

Filling NA values:
   ID     Name  Age   Salary
0   1    Alice   25  50000.0
1   2      Bob   30  60000.0
2   3  Charlie   35  75000.0
3   4    David   40  90000.0
4   5      Eve   45  68750.0

In [29]:
print("\nMerging DataFrames:")
merged_df = pd.merge(df1, df2, on='ID', how='outer')
print(merged_df)

Merging DataFrames:
   ID     Name   Age   Salary Department       Location
0   1    Alice  25.0  50000.0        NaN            NaN
1   2      Bob  30.0  60000.0        NaN            NaN
2   3  Charlie  35.0  75000.0         HR       New York
3   4    David  40.0  90000.0         IT  San Francisco
4   5      Eve  45.0      NaN    Finance        Chicago
5   6      NaN   NaN      NaN  Marketing         Boston
6   7      NaN   NaN      NaN      Sales    Los Angeles

In [31]:
merged_inner_df = pd.merge(df1, df2, on='ID', how='inner')
print(merged_inner_df)

   ID     Name  Age   Salary Department       Location
0   3  Charlie   35  75000.0         HR       New York
1   4    David   40  90000.0         IT  San Francisco
2   5      Eve   45      NaN    Finance        Chicago

In [32]:
print("\nConcatenating DataFrames:")
concat_df = pd.concat([df1, df2], axis=1)
print(concat_df)

Concatenating DataFrames:
   ID     Name  Age   Salary  ID Department       Location
0   1    Alice   25  50000.0   3         HR       New York
1   2      Bob   30  60000.0   4         IT  San Francisco
2   3  Charlie   35  75000.0   5    Finance        Chicago
3   4    David   40  90000.0   6  Marketing         Boston
4   5      Eve   45      NaN   7      Sales    Los Angeles

In [33]:
print("\nConcatenating DataFrames:")
concat_df = pd.concat([df1, df2], axis=0)
print(concat_df)

Concatenating DataFrames:
   ID     Name   Age   Salary Department       Location
0   1    Alice  25.0  50000.0        NaN            NaN
1   2      Bob  30.0  60000.0        NaN            NaN
2   3  Charlie  35.0  75000.0        NaN            NaN
3   4    David  40.0  90000.0        NaN            NaN
4   5      Eve  45.0      NaN        NaN            NaN
0   3      NaN   NaN      NaN         HR       New York
1   4      NaN   NaN      NaN         IT  San Francisco
2   5      NaN   NaN      NaN    Finance        Chicago
3   6      NaN   NaN      NaN  Marketing         Boston
4   7      NaN   NaN      NaN      Sales    Los Angeles

In [34]:
print("\nJoining DataFrames:")
joined_df = df1.set_index('ID').join(df2.set_index('ID'), how='outer')
print(joined_df.reset_index())

Joining DataFrames:
   ID     Name   Age   Salary Department       Location
0   1    Alice  25.0  50000.0        NaN            NaN
1   2      Bob  30.0  60000.0        NaN            NaN
2   3  Charlie  35.0  75000.0         HR       New York
3   4    David  40.0  90000.0         IT  San Francisco
4   5      Eve  45.0      NaN    Finance        Chicago
5   6      NaN   NaN      NaN  Marketing         Boston
6   7      NaN   NaN      NaN      Sales    Los Angeles

In [35]:
print("\nGrouping by Department and calculating mean Age and Salary:")
grouped = merged_df.groupby('Department')[['Age', 'Salary']].mean()
print(grouped)

Grouping by Department and calculating mean Age and Salary:
             Age   Salary
Department
Finance     45.0      NaN
HR          35.0  75000.0
IT          40.0  90000.0
Marketing    NaN      NaN
Sales        NaN      NaN